{
	"title" : "themaxsandelin",
	"time" : "1490803801.794921",
	"id" : "Twabswilty",
	"description" : "There will always be somebody who is luckier than you, just like there will always be somebody who is unluckier. We can’t decide which reality we are born into, the environment we are born in or the family that we are given. You should appreciate and be happy for the life you were given because there is always someone who was born into a “worse” environment than you. But that does not mean you should settle, as if that wouldn’t be appreciative of you. If you are unhappy with where you are in life, with the people you associate yourself with, with the job you have, it’s up to you to change it. You are not doing anyone a favor by settling for the things you get, going through life as if it’s something that’s just happening to you and your just supposed to enjoy it as much as you can. And if you were born into a reality that contains more obstacles in your path towards a goal or a dream, where your peers might not have those same obstacles, you shouldn’t feel like you can’t do it. Having more obstacles in your way, more things to do, does indeed make the process “harder” for you, but it also presents you with an opportunity to grow stronger as a person and to learn things that your peers won’t be able to. Whatever you choose to do in life should never be based on the thought that you should do it because everybody else is doing them. What others do and don’t do in their life should not determine what you do and don’t do in your life. You should only do what makes you happy, what makes you feel healthy and whole, what makes you feel like you are making this world a better place for someone. Life is not just about having a job and paying the bills, life can be so much more than that if you truly want it to. It doesn’t matter what you tell me or anybody else about if you are happy or not, what matters is what you tell yourself. If you lie to yourself about being happy, thinking that you are only unappreciative but really you are miserable with where you are, you will do more harm to yourself and the people around you than you do good. If you are happy that’s great, I’m happy for you! But if you’re not, just know that you can be but it’s up to you."
}