{
	"title" : "themaxsandelin",
	"time" : "1490717598.513214",
	"id" : "Twgotapisi",
	"description" : "This week got off to a pretty insane start in terms of things to do. Our customer at one of the projects at Volvo has been one of the worst I have ever experiences, and it’s not something personal it’s just the way he expects things to work. I’m not complaining either, though his behavior has certainly caused several deliveries to be delayed due to last minute changes and going back and forth between features. He’s also the type of customer who get’s very aggravated when we make a lot of progress on the back-end but not on the front-end, because he can’t see the changes. So these first two days have been allocated to working on making design changes and implementation on things that aren’t working in the back-end, to get the customer off our backs so we can continue working on the back-end features. This is usually the main reason why I can’t post every day, because I end up having way too much to do that I have to prioritize differently. I’ve been looking into scheduling my posts, but the thing is that the content I write is based on my daily work, what I did the same day or the day before or when I feel like sharing what I feel or think at that very moment. So it’s quite hard to write out x-amounts of posts with that type of content, but I’ve not dismissed that idea completely. Apart from working tirelessly on the Volvo projects I’ve also really invested myself in my main project, focusing on the entrepreneurial view of the company. After I realized I was going at my projects with the mindset of a technician I’ve been directing my focus around the entrepreneurial mindset, as I want to do that kind of work and have the control rather than produce the product(s) we will sell. With that said I am working on the MVP as someone has to build that and it makes more sense to use the resources at hand rather than trying to find the money to hire someone else to build it, at least now in the beginning. Anyway, I’m getting ahead of myself, our focus right now is planning and defining the MVP and it’s features as detailed as possible. But I hope you had a great start to your week, I know you are killing it and of course, keep up the hustle! 👊🏻"
}